Check output of DFG analysis with basic loop program

  $ bincaml script loop_dfg.sexp
  (load-il ../../examples/loop.il)
  (run-transforms ssa)
  (run-transforms demoprint-dfg-ivalbits-product)
  tnumWintReduceProductMapLattice :: @main
  (_->⊥, R0_in:bv64->(⊤, ⊤), R1_in:bv64->(⊤, ⊤),
       R0_out:bv64->(0000000000000000000000000000000000000000000000000000000000001010, ⟦0xa:bv64, 0xa:bv64⟧),
       R1_out:bv64->(μμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμ, ⊤),
       R0_1:bv64->(⊤, ⊤), R1_1:bv64->(⊤, ⊤),
       R0_2:bv64->(0000000000000000000000000000000000000000000000000000000000000000, ⟦0x0:bv64, 0x0:bv64⟧),
       R1_2:bv64->(0000000000000000000000000000000000000000000000000000000000000000, ⟦0x0:bv64, 0x0:bv64⟧),
       R1_3:bv64->(μμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμ, ⊤),
       R0_3:bv64->(000000000000000000000000000000000000000000000000000000000000μμμμ, ⟦0x0:bv64, 0xa:bv64⟧),
       R0_4:bv64->(000000000000000000000000000000000000000000000000000000000000μμμμ, ⟦0x0:bv64, 0x9:bv64⟧),
       R1_4:bv64->(μμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμμ, ⊤),
       R0_5:bv64->(000000000000000000000000000000000000000000000000000000000000μμμμ, ⟦0x1:bv64, 0xa:bv64⟧),
       R0_6:bv64->(0000000000000000000000000000000000000000000000000000000000001010, ⟦0xa:bv64, 0xa:bv64⟧))
